<template>
  <div>
    <mu-appbar title='更新记录'>
      <mu-icon-button icon='arrow_back' @click='$router.back()' slot='left'/>
    </mu-appbar>
    <mu-timeline lineColor="black" class="p10">
      <template v-for='item in list'>
        <mu-timeline-item>
          <span slot="time">{{item.time}}</span>
          <span slot="des" class="font12" v-html="item.desc"></span>
        </mu-timeline-item>
        <mu-timeline-item>
          <mu-icon value="flight_takeoff" color="red" slot="icon"/>
          <span>发布{{item.v}}版本</span>
        </mu-timeline-item>
      </template>

      <mu-timeline-item>
        <span slot="time">2011年 6月 7日</span>
        <span slot="des" class="font12">
          机汇网App上线,产品、新闻一目了然<br>随时随地地移动管控<br>更安全，更便捷
        </span>
      </mu-timeline-item>
      <mu-timeline-item iconLine="5">
        <span>发布1.0版本</span>
      </mu-timeline-item>
    </mu-timeline>
  </div>
</template>
<script>
export default {
  data () {
    return {
      list: [
        {v: '2.2.6', time: '2018年 3月 15日', desc: '修复分类保存后中文变乱码'},
        {v: '2.2.5', time: '2018年 3月 8日', desc: '修复产品分类不能修改'},
        {v: '2.2.4', time: '2017年 12月 8日', desc: '修复个别账号商城数据未显示<br>修复操作记录时间格式错误'},
        {v: '2.2.3', time: '2017年 10月 23日', desc: '删除机汇网商城'},
        {v: '2.2.2', time: '2017年 9月 22日', desc: '修复我的推广会员中时间格式错误'},
        {v: '2.2.1', time: '2017年 8月 8日', desc: '加载app空白页面添加加载动画'},
        {v: '2.2.0', time: '2017年 7月 17日', desc: '修复订单详细图标不对，订单状态为英文'},
        {v: '2.1.9', time: '2017年 6月 5日', desc: '修复微分销会员数据未显示'},
        {v: '2.1.8', time: '2017年 4月 18日', desc: '手机网站改版后更新微网站'},
        {v: '2.1.7', time: '2017年 1月 3日', desc: '新增参与推广<br>1.推广分类：促销类、产品类、人物类、知识类<br>2.我推广的会员'},
        {v: '2.1.6', time: '2016年 11月 18日', desc: '修复图片太大上传不了问题'},
        {v: '2.1.5', time: '2016年 10月 10日', desc: '新增关于机汇网<br>1.新版本检测<br>2.更新记录<br>3.官方微信二维码，app下载二维码'},
        {v: '2.1.4', time: '2016年 8月 9日', desc: '删除企业联系人、招聘管理'},
        {v: '2.1.3', time: '2016年 5月 6日', desc: '新增账号资料'},
        {v: '2.1.2', time: '2016年 4月 16日', desc: '新增服务中心<br/>1.常见问题<br/>2.我的客服<br/>3.咨询QQ'},
        {v: '2.1.1', time: '2016年 1月 2日', desc: '新增微分销<br/>1.会员数据<br/>2.排行数据<br/>3.提现数据'},
        {v: '2.1.0', time: '2015年 10月 23日', desc: '新增微传单<br/>1.我的微传单<br/>2.VIP专属<br/>3.案例展示'},
        {v: '2.0.9', time: '2015年 11月 12日', desc: '新增店铺数据<br/>1.支付金额，买家数，支付件数<br/>2.客户购买数量排行<br/>3.客户购买金额排行'},
        {v: '2.0.8', time: '2015年 10月 2日', desc: '首页: 页面样式更新'},
        {v: '2.0.7', time: '2015年 7月 7日', desc: '1.新增积分明细<br/>2.新增兑换记录<br/>3.积分排行'},
        {v: '2.0.6', time: '2015年 5月 8日', desc: '更新积分规则，修改积分获得数量'},
        {v: '2.0.5', time: '2015年 3月 18日', desc: '新增我的积分<br/>1.可用积分和积分排行<br/>2.兑换软文，移动办公布属，1000积分兑丁丁、微信布属'},
        {v: '2.0.4', time: '2015年 1月 10日', desc: '新增视频教程'},
        {v: '2.0.3', time: '2014年 11月 13日', desc: '新增seo帮助'},
        {v: '2.0.2', time: '2014年 10月 1日', desc: '新增服务进度<br/>1.正在服务<br/>2.服务结束'},
        {v: '2.0.1', time: '2014年 8月 23日', desc: '新增服务缴费<br/>1.待缴费，多选缴费费用，合计选中金额<br/>2.新增历史缴费、服务记录<br/>3.添加支付宝，微信支付二级码和银行转账'},
        {v: '2.0', time: '2014年 5月 11日', desc: '第二版本发布，底层代码更新，前端框架重置'},
        {v: '1.2.0', time: '2014年 3月 7日', desc: '新增微网站和微网站案例'},
        {v: '1.1.9', time: '2014年 1月 4日', desc: '新增招聘管理'},
        {v: '1.1.8', time: '2013年 12月 3日', desc: '新增企业联系人'},
        {v: '1.1.7', time: '2013年 11月 18日', desc: '更新底部导航图标，边框'},
        {v: '1.1.6', time: '2013年 10月 23日', desc: '更新产品，添加商城属性（价格，重量，库存和积分）'},
        {v: '1.1.5', time: '2013年 6月 28日', desc: '更新产品分类添加和修改'},
        {v: '1.1.4', time: '2013年 3月 19日', desc: '优化背景样式，网页加载速度'},
        {v: '1.1.3', time: '2013年 2月 27日', desc: '设置添加机汇微商城链接'},
        {v: '1.1.2', time: '2012年 12月 10日', desc: '新增用户反馈'},
        {v: '1.1.1', time: '2012年 10月 23日', desc: '新增域名绑定，添加，删除和显示审核状态'},
        {v: '1.1.0', time: '2012年 8月 1日', desc: '新增产品，新闻和手机网站静态化'},
        {v: '1.0.9', time: '2012年 7月 3日', desc: '新增未读询盘'},
        {v: '1.0.8', time: '2012年 5月 7日', desc: '修复API 数据缓存和代码优化'},
        {v: '1.0.7', time: '2012年 3月 7日', desc: '新增友情链接'},
        {v: '1.0.6', time: '2012年 1月 10日', desc: '新增相册管理'},
        {v: '1.0.5', time: '2011年 12月 9日', desc: '新增证书管理'},
        {v: '1.0.4', time: '2011年 10月 15日', desc: '新增会员管理，显示会员详细数据'},
        {v: '1.0.3', time: '2011年 9月 4日', desc: '更新当前版本，同步显示手机版本'},
        {v: '1.0.2', time: '2011年 8月 22日', desc: '新增流量分析CNZZ下载页面'},
        {v: '1.0.1', time: '2011年 7月 11日', desc: '新增订单功能，订单详细数据查看，可发货和修改价格'}
      ]
    }
  }
}
</script>
